In [ ]:
#2개의 데이터프레임 합치기

In [6]:
import pandas as pd

In [7]:
one = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

two = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

three = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

four = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]

In [10]:
df1 = pd.DataFrame(one, columns = ['name', 'job'])
df2 = pd.DataFrame(two, columns = ['name', 'job'])

In [11]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [12]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [ ]:
# concat(): 두 개의 dataframe을 합친다

In [21]:
result1 = pd.concat([df1, df2])

In [22]:
result1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [19]:
#index가 자동적으로 순서대로 달리도록해준다
result2 = pd.concat([df1, df2], ignore_index= True)

In [20]:
result2

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [23]:
df1 = pd.DataFrame(three, columns = ['name', 'job'])
df2 = pd.DataFrame(four, columns = ['age', 'country'])

In [24]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [25]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [26]:
#axis = 1은 column(열)로 넣으라는 의미!
result = pd.concat([df1, df2], axis = 1, ignore_index = True)

In [27]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

In [ ]:
# 보너스 트랙
# dictionary형식으로  두 변수를 집어넣어주면, 합쳐진 dataframe이 생성된다.

In [29]:
label = [1,2,3,4,5]
prediction = [1,2,3,4,4]

In [30]:
comparison = pd.DataFrame({'label': label, 'prediction': prediction})

In [ ]:
# label과 predicition을 비교하며 한 눈에 쉽게 볼 수 있다.

In [31]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           3
3      4           4
4      5           4